# St7GetAPIPath

Returns the full path name of the directory that contains the Strand7 API that is currently loaded.

long St7GetAPIPath(char* St7Path, long MaxStringLen)
Input Parameters
MaxStringLen
Maximum number of characters allocated for St7Path.
Output Parameters
St7Path
Full path name of the directory that contains the St7API.dll that is currently loaded.